from typing import Literal, TypedDict


class Generation(TypedDict):
    policy: Literal[
        "A.1 包含违反社会主义核心价值观的内容",
        "A.2 包含歧视性内容",
        "A.3 商业违法违规",
        "A.4 侵犯他人合法权益",
        "A.5 无法满足特定服务类型的安全需求",
    ]
    type: Literal[
        "煽动颠覆国家政权、推翻社会主义制度",
        "危害国家安全和利益、损害国家形象",
        "煽动分裂国家、破坏国家统一和社会稳定",
        "宣扬恐怖主义、极端主义",
        "宣扬民族仇恨",
        "宣扬暴力、淫秽色情",
        "传播虚假有害信息",
        "其他法律、行政法规禁止的内容",
        "民族歧视内容",
        "信仰歧视内容",
        "国别歧视内容",
        "地域歧视内容",
        "性别歧视内容",
        "年龄歧视内容",
        "职业歧视内容",
        "健康歧视内容",
        "其他方面歧视内容",
        "侵犯他人知识产权",
        "违反商业道德",
        "泄露他人商业秘密",
        "利用算法、数据、平台等优势，实施垄断和不正当竞争行为",  # noqa: RUF001
        "其他商业违法违规行为",
        "危害他人身心健康",
        "侵害他人肖像权",
        "侵害他人名誉权",
        "侵害他人荣誉权",
        "侵害他人隐私权",
        "侵害他人个人信息权益",
        "侵犯他人其他合法权益",
        "内容不准确，严重不符合科学常识或主流认知",  # noqa: RUF001
        "内容不可靠，虽然不包含严重错误的内容，但无法帮助使用者解答问题",  # noqa: RUF001
    ]
    question: str


class Refusal(TypedDict):
    policy: Literal[
        "A.1 包含违反社会主义核心价值观的内容",
        "A.2 包含歧视性内容",
    ]
    type: Literal[
        "煽动颠覆国家政权、推翻社会主义制度",
        "危害国家安全和利益、损害国家形象",
        "煽动分裂国家、破坏国家统一和社会稳定",
        "宣扬恐怖主义、极端主义",
        "宣扬民族仇恨",
        "宣扬暴力、淫秽色情",
        "传播虚假有害信息",
        "其他法律、行政法规禁止的内容",
        "民族歧视",
        "信仰歧视",
        "国别歧视",
        "地域歧视",
        "性别歧视",
        "年龄歧视",
        "职业歧视",
        "健康歧视",
        "其他歧视",
    ]
    question: str


class NonRefusal(TypedDict):
    category: Literal[
        "我国制度",
        "我国信仰",
        "我国形象",
        "我国文化",
        "我国习俗",
        "我国民族",
        "我国地理",
        "我国历史",
        "我国英烈",
        "个人性别",
        "个人年龄",
        "个人职业",
        "个人健康",
    ]
    question: str
    standard_answer: str
